script/k6-scripts/results/20260619-214734/jwt_false_casbin_false_rl_false_pool_false_market_apps_list.log
 Container RPA-pgdb Running 
 Container RPA-minio Running 
 Container rmqnamesrv Running 
 Container RPA-cadvisor Running 
 Container RPA-redis Running 
 Container RPA-prometheus Running 
 Container rmqbroker Running 
 Container RPA-app Running 
 Container script-k6-run-5a79d7e063c0 Creating 
 Container script-k6-run-5a79d7e063c0 Created 

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/apis/market_apps_list.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * single_api: 600.00 iterations/s for 1m0s (maxVUs: 150-200, exec: singleApi, gracefulStop: 30s)


running (0m01.0s), 001/150 VUs, 590 complete and 0 interrupted iterations
single_api   [   2% ] 001/150 VUs  0m01.0s/1m0s  600.00 iters/s

running (0m02.0s), 001/150 VUs, 1189 complete and 0 interrupted iterations
single_api   [   3% ] 001/150 VUs  0m02.0s/1m0s  600.00 iters/s

running (0m03.0s), 001/150 VUs, 1789 complete and 0 interrupted iterations
single_api   [   5% ] 001/150 VUs  0m03.0s/1m0s  600.00 iters/s

running (0m04.0s), 001/150 VUs, 2390 complete and 0 interrupted iterations
single_api   [   7% ] 001/150 VUs  0m04.0s/1m0s  600.00 iters/s

running (0m05.0s), 001/150 VUs, 2990 complete and 0 interrupted iterations
single_api   [   8% ] 001/150 VUs  0m05.0s/1m0s  600.00 iters/s

running (0m06.0s), 001/150 VUs, 3589 complete and 0 interrupted iterations
single_api   [  10% ] 000/150 VUs  0m06.0s/1m0s  600.00 iters/s

running (0m07.0s), 001/150 VUs, 4190 complete and 0 interrupted iterations
single_api   [  12% ] 001/150 VUs  0m07.0s/1m0s  600.00 iters/s

running (0m08.0s), 001/150 VUs, 4789 complete and 0 interrupted iterations
single_api   [  13% ] 001/150 VUs  0m08.0s/1m0s  600.00 iters/s

running (0m09.0s), 000/150 VUs, 5390 complete and 0 interrupted iterations
single_api   [  15% ] 000/150 VUs  0m09.0s/1m0s  600.00 iters/s

running (0m10.0s), 001/150 VUs, 5989 complete and 0 interrupted iterations
single_api   [  17% ] 001/150 VUs  0m10.0s/1m0s  600.00 iters/s

running (0m11.0s), 001/150 VUs, 6590 complete and 0 interrupted iterations
single_api   [  18% ] 001/150 VUs  0m11.0s/1m0s  600.00 iters/s

running (0m12.0s), 002/150 VUs, 7189 complete and 0 interrupted iterations
single_api   [  20% ] 002/150 VUs  0m12.0s/1m0s  600.00 iters/s

running (0m13.0s), 000/150 VUs, 7790 complete and 0 interrupted iterations
single_api   [  22% ] 000/150 VUs  0m13.0s/1m0s  600.00 iters/s

running (0m14.0s), 001/150 VUs, 8390 complete and 0 interrupted iterations
single_api   [  23% ] 001/150 VUs  0m14.0s/1m0s  600.00 iters/s

running (0m15.0s), 000/150 VUs, 8990 complete and 0 interrupted iterations
single_api   [  25% ] 000/150 VUs  0m15.0s/1m0s  600.00 iters/s

running (0m16.0s), 001/150 VUs, 9590 complete and 0 interrupted iterations
single_api   [  27% ] 001/150 VUs  0m16.0s/1m0s  600.00 iters/s

running (0m17.0s), 001/150 VUs, 10189 complete and 0 interrupted iterations
single_api   [  28% ] 001/150 VUs  0m17.0s/1m0s  600.00 iters/s

running (0m18.0s), 002/150 VUs, 10789 complete and 0 interrupted iterations
single_api   [  30% ] 002/150 VUs  0m18.0s/1m0s  600.00 iters/s

running (0m19.0s), 001/150 VUs, 11390 complete and 0 interrupted iterations
single_api   [  32% ] 001/150 VUs  0m19.0s/1m0s  600.00 iters/s

running (0m20.0s), 002/150 VUs, 11989 complete and 0 interrupted iterations
single_api   [  33% ] 002/150 VUs  0m20.0s/1m0s  600.00 iters/s

running (0m21.0s), 002/150 VUs, 12589 complete and 0 interrupted iterations
single_api   [  35% ] 002/150 VUs  0m21.0s/1m0s  600.00 iters/s

running (0m22.0s), 000/150 VUs, 13190 complete and 0 interrupted iterations
single_api   [  37% ] 000/150 VUs  0m22.0s/1m0s  600.00 iters/s

running (0m23.0s), 001/150 VUs, 13789 complete and 0 interrupted iterations
single_api   [  38% ] 001/150 VUs  0m23.0s/1m0s  600.00 iters/s

running (0m24.0s), 000/150 VUs, 14390 complete and 0 interrupted iterations
single_api   [  40% ] 000/150 VUs  0m24.0s/1m0s  600.00 iters/s

running (0m25.0s), 000/150 VUs, 14990 complete and 0 interrupted iterations
single_api   [  42% ] 000/150 VUs  0m25.0s/1m0s  600.00 iters/s

running (0m26.0s), 001/150 VUs, 15589 complete and 0 interrupted iterations
single_api   [  43% ] 001/150 VUs  0m26.0s/1m0s  600.00 iters/s

running (0m27.0s), 001/150 VUs, 16189 complete and 0 interrupted iterations
single_api   [  45% ] 001/150 VUs  0m27.0s/1m0s  600.00 iters/s

running (0m28.0s), 002/150 VUs, 16789 complete and 0 interrupted iterations
single_api   [  47% ] 002/150 VUs  0m28.0s/1m0s  600.00 iters/s

running (0m29.0s), 002/150 VUs, 17389 complete and 0 interrupted iterations
single_api   [  48% ] 002/150 VUs  0m29.0s/1m0s  600.00 iters/s

running (0m30.0s), 002/150 VUs, 17989 complete and 0 interrupted iterations
single_api   [  50% ] 002/150 VUs  0m30.0s/1m0s  600.00 iters/s

running (0m31.0s), 001/150 VUs, 18589 complete and 0 interrupted iterations
single_api   [  52% ] 001/150 VUs  0m31.0s/1m0s  600.00 iters/s

running (0m32.0s), 001/150 VUs, 19190 complete and 0 interrupted iterations
single_api   [  53% ] 001/150 VUs  0m32.0s/1m0s  600.00 iters/s

running (0m33.0s), 001/150 VUs, 19790 complete and 0 interrupted iterations
single_api   [  55% ] 001/150 VUs  0m33.0s/1m0s  600.00 iters/s

running (0m34.0s), 002/150 VUs, 20389 complete and 0 interrupted iterations
single_api   [  57% ] 002/150 VUs  0m34.0s/1m0s  600.00 iters/s

running (0m35.0s), 001/150 VUs, 20990 complete and 0 interrupted iterations
single_api   [  58% ] 001/150 VUs  0m35.0s/1m0s  600.00 iters/s

running (0m36.0s), 001/150 VUs, 21590 complete and 0 interrupted iterations
single_api   [  60% ] 001/150 VUs  0m36.0s/1m0s  600.00 iters/s

running (0m37.0s), 002/150 VUs, 22189 complete and 0 interrupted iterations
single_api   [  62% ] 002/150 VUs  0m37.0s/1m0s  600.00 iters/s

running (0m38.0s), 001/150 VUs, 22790 complete and 0 interrupted iterations
single_api   [  63% ] 001/150 VUs  0m38.0s/1m0s  600.00 iters/s

running (0m39.0s), 002/150 VUs, 23389 complete and 0 interrupted iterations
single_api   [  65% ] 002/150 VUs  0m39.0s/1m0s  600.00 iters/s

running (0m40.0s), 001/150 VUs, 23990 complete and 0 interrupted iterations
single_api   [  67% ] 001/150 VUs  0m40.0s/1m0s  600.00 iters/s

running (0m41.0s), 002/150 VUs, 24589 complete and 0 interrupted iterations
single_api   [  68% ] 002/150 VUs  0m41.0s/1m0s  600.00 iters/s

running (0m42.0s), 001/150 VUs, 25190 complete and 0 interrupted iterations
single_api   [  70% ] 001/150 VUs  0m42.0s/1m0s  600.00 iters/s

running (0m43.0s), 000/150 VUs, 25790 complete and 0 interrupted iterations
single_api   [  72% ] 000/150 VUs  0m43.0s/1m0s  600.00 iters/s

running (0m44.0s), 001/150 VUs, 26390 complete and 0 interrupted iterations
single_api   [  73% ] 001/150 VUs  0m44.0s/1m0s  600.00 iters/s

running (0m45.0s), 002/150 VUs, 26989 complete and 0 interrupted iterations
single_api   [  75% ] 002/150 VUs  0m45.0s/1m0s  600.00 iters/s

running (0m46.0s), 001/150 VUs, 27589 complete and 0 interrupted iterations
single_api   [  77% ] 001/150 VUs  0m46.0s/1m0s  600.00 iters/s

running (0m47.0s), 001/150 VUs, 28189 complete and 0 interrupted iterations
single_api   [  78% ] 001/150 VUs  0m47.0s/1m0s  600.00 iters/s

running (0m48.0s), 001/150 VUs, 28790 complete and 0 interrupted iterations
single_api   [  80% ] 001/150 VUs  0m48.0s/1m0s  600.00 iters/s

running (0m49.0s), 002/150 VUs, 29389 complete and 0 interrupted iterations
single_api   [  82% ] 002/150 VUs  0m49.0s/1m0s  600.00 iters/s

running (0m50.0s), 001/150 VUs, 29990 complete and 0 interrupted iterations
single_api   [  83% ] 001/150 VUs  0m50.0s/1m0s  600.00 iters/s

running (0m51.0s), 001/150 VUs, 30590 complete and 0 interrupted iterations
single_api   [  85% ] 001/150 VUs  0m51.0s/1m0s  600.00 iters/s

running (0m52.0s), 000/150 VUs, 31190 complete and 0 interrupted iterations
single_api   [  87% ] 000/150 VUs  0m52.0s/1m0s  600.00 iters/s

running (0m53.0s), 000/150 VUs, 31790 complete and 0 interrupted iterations
single_api   [  88% ] 001/150 VUs  0m53.0s/1m0s  600.00 iters/s

running (0m54.0s), 001/150 VUs, 32389 complete and 0 interrupted iterations
single_api   [  90% ] 001/150 VUs  0m54.0s/1m0s  600.00 iters/s

running (0m55.0s), 002/150 VUs, 32989 complete and 0 interrupted iterations
single_api   [  92% ] 002/150 VUs  0m55.0s/1m0s  600.00 iters/s

running (0m56.0s), 001/150 VUs, 33589 complete and 0 interrupted iterations
single_api   [  93% ] 002/150 VUs  0m56.0s/1m0s  600.00 iters/s

running (0m57.0s), 002/150 VUs, 34189 complete and 0 interrupted iterations
single_api   [  95% ] 002/150 VUs  0m57.0s/1m0s  600.00 iters/s

running (0m58.0s), 002/150 VUs, 34789 complete and 0 interrupted iterations
single_api   [  97% ] 002/150 VUs  0m58.0s/1m0s  600.00 iters/s

running (0m59.0s), 002/150 VUs, 35389 complete and 0 interrupted iterations
single_api   [  98% ] 002/150 VUs  0m59.0s/1m0s  600.00 iters/s

running (1m00.0s), 001/150 VUs, 35990 complete and 0 interrupted iterations
single_api   [ 100% ] 001/150 VUs  1m00.0s/1m0s  600.00 iters/s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=1.59ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 36000   599.9917/s
    checks_succeeded...: 100.00% 36000 out of 36000
    checks_failed......: 0.00%   0 out of 36000

    ✓ market_apps_list status

    HTTP
    http_req_duration..............: avg=1.15ms min=590.9µs  med=1.19ms max=8.56ms  p(90)=1.51ms p(95)=1.59ms
      { expected_response:true }...: avg=1.15ms min=590.9µs  med=1.19ms max=8.56ms  p(90)=1.51ms p(95)=1.59ms
    http_req_failed................: 0.00%  0 out of 36000
    http_reqs......................: 36000  599.9917/s

    EXECUTION
    iteration_duration.............: avg=1.29ms min=651.85µs med=1.34ms max=19.12ms p(90)=1.68ms p(95)=1.78ms
    iterations.....................: 36000  599.9917/s
    vus............................: 0      min=0          max=2  
    vus_max........................: 150    min=150        max=150

    NETWORK
    data_received..................: 504 MB 8.4 MB/s
    data_sent......................: 5.9 MB 98 kB/s



running (1m00.0s), 000/150 VUs, 36000 complete and 0 interrupted iterations
single_api ✓ [ 100% ] 000/150 VUs  1m0s  600.00 iters/s